{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: difficulty levels, level progression, power-ups, audio system, and visual themes, with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing the game's architecture including components, hooks, game engine, and styling with warm earth-tone OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color values for light and dark themes, including warm earth tones and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/src/App.tsx": "Main app component managing screen navigation (menu, game, highscores, instructions), difficulty selection, and rendering appropriate views with game controls and instructions.",
  "frontend/src/components/AudioControls.tsx": "Audio settings UI component with sliders for music and sound effects volume, mute toggle button, and percentage displays using the useAudioManager hook.",
  "frontend/src/components/Game.tsx": "Core game component managing canvas setup, GameEngine lifecycle, game loop with requestAnimationFrame, pause/resume, audio integration, level persistence, and game over handling.",
  "frontend/src/components/GameUI.tsx": "In-game HUD displaying current level, score, high score, and active power-ups with icons, names, and countdown timers in a styled card layout.",
  "frontend/src/components/HighScores.tsx": "React component that displays a list of high scores with ranking badges, date information, and options to clear all scores or navigate back. Uses local storage via useGameStorage hook and includes an alert dialog for score deletion confirmation.",
  "frontend/src/components/LevelBadge.tsx": "React component that displays an animated badge overlay when the player reaches milestone levels (1, 5, or 10). Shows a level-specific badge image with fade-in/zoom animation that auto-dismisses after 3 seconds.",
  "frontend/src/game/GameEngine.ts": "Core game engine class that manages game state, spawns obstacles and power-ups, handles collisions, tracks score and levels, applies difficulty settings, and manages theme transitions. Includes methods for updating game logic, rendering, and coordinating audio callbacks.",
  "frontend/src/game/Player.ts": "PlayerCharacter class that handles player movement via keyboard input (arrow keys or A/D), boundary collision, shield state, and rendering with gradient fill and shield visual effect. Manages event listeners for keyboard controls.",
  "frontend/src/game/themes.ts": "Defines visual themes (beginner, intermediate, advanced, expert) with background gradients, obstacle colors, and accent colors. Exports getLevelTheme function that returns appropriate theme based on current level.",
  "frontend/src/game/types.ts": "TypeScript type definitions for game entities including Position, Size, Player, Obstacle, PowerUp, GameState, ScoreEntry, Difficulty levels, and LevelTheme configuration interfaces.",
  "frontend/src/hooks/useActor.ts": "React hook that manages backend actor creation with Internet Identity authentication using React Query. Creates authenticated or anonymous actors based on identity state and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useAudioManager.ts": "React hook that manages game audio including background music and sound effects (collision, power-up, milestone) with volume controls, mute toggle, and localStorage persistence. Preloads audio files and provides playback control functions.",
  "frontend/src/hooks/useGameStorage.ts": "React hook that provides localStorage-based persistence for high scores (top 10), difficulty settings, and current level. Includes methods to save/retrieve scores, manage difficulty, and clear stored data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Intentionally minimal file with no exports, as the game works entirely offline without backend queries.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with warm earth-tone color palette (terracotta, amber, sage) for both light and dark modes, plus custom utility classes for game elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme with custom fonts (Inter, Poppins), OKLCH color system for warm earth tones, custom shadows, and animation keyframes for accordions.",
  "project_state.json": "Project metadata defining an offline game with features including difficulty levels, power-ups, level progression, sound effects, and visual themes using warm earth-tone styling."
}